package chapter13;

/*
    === 빌드 도구 === (Gradle, Maven)
    1. 정의
     소프트웨어 개발 과정에서 필요한 코드의
     컴파일, 패키징, 테스트, 배포 등의 작업을 자동화하는 도구를 말한다.
    2. 종류
     1) Maven
       : Apache Software Foundation 회사에서 제공하는 빌드 도구
       - XML 기반의 설정 파일을 사용한다 (pom.xml)
       - 장점 : 간단하고 익숙한 도구, 널리 사용되는 도구 (커뮤니티성이 높고, 플러그인이 다양)
         단점 : XML의 복잡한 구조로 설정이 길어진다

     2) Gradle
      : 오픈소스 기반의 빌드 도구
      - Groovy 또는 Kotlin DSL을 이용한 설정 파일을 사용한다 (build.gradle)
      - 장점 : 설정 파일이 간결하고, 다양한 언어와 프레임 워크를 지원한다, 대규모 프로젝트에서 사용된다.
        단점 : 러닝 커브가 존재한다, 설정에 대한 과도한 자유도가 복잡성을 유발한다.
 */

public class Z_Build {
}
